
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
		
	Параметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Шаблон");
	Если Параметр <> Неопределено  Тогда
		Элемент = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Параметр.ИдентификаторПользовательскойНастройки);
		Если Элемент <> Неопределено И Элемент.Использование Тогда
				ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ШаблонИзм");
				ПараметрСКД.Использование = Истина;
   				ПараметрСКД.Значение     =  СтрЗаменить(СтрЗаменить(Элемент.Значение, "?", "_"), "*", "%");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры