
&НаСервере
Процедура ПолучитьСтруктуруНаСервере()
	
	СтруктураБД = ПолучитьСтруктуруХраненияБазыДанных(); 
	
	СтруктураБД.Колонки.Удалить(СтруктураБД.Колонки.Количество() - 1);
	СтруктураБД.Колонки.Удалить(СтруктураБД.Колонки.Количество() - 1);
	
	Назначения = новый Массив();
	
	Назначения.Добавить("Основная");
	Назначения.Добавить("ТабличнаяЧасть");
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БД.ИмяТаблицыХранения КАК ИмяТаблицыХранения,
		|	БД.ИмяТаблицы КАК ИмяТаблицы,
		|	ВЫРАЗИТЬ(БД.Назначение КАК СТРОКА(50)) КАК Назначение
		|ПОМЕСТИТЬ БДВР
		|ИЗ
		|	&БД КАК БД
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	БД.ИмяТаблицыХранения КАК ИмяТаблицыХранения,
		|	БД.ИмяТаблицы КАК ИмяТаблицы
		|ИЗ
		|	БДВР КАК БД
		|ГДЕ
		|	БД.Назначение В(&Назначение)";
	
	Запрос.УстановитьПараметр("БД", СтруктураБД); 
	Запрос.УстановитьПараметр("Назначение", Назначения); 
		
	РезультатЗапроса = Запрос.Выполнить();
	
	ТЧ.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСтруктуру(Команда)
	ПолучитьСтруктуруНаСервере();
КонецПроцедуры
